In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                   'k2':['alpha','beta','alpha','beta','alpha'],
                   'dataset1':np.random.randn(5),
                   'dataset2':np.random.randn(5)})

In [3]:
dframe

   dataset1  dataset2 k1     k2
0  0.309461  0.116702  X  alpha
1 -0.357755  1.133424  X   beta
2  0.392646  2.208642  Y  alpha
3 -0.044744  0.788048  Y   beta
4 -2.107884 -0.690729  Z  alpha

In [4]:
# create a SeriesGroupBy Object
group1 = dframe.groupby('k1')
#group1 = dframe['dataset1'].groupby(dframe['k1'])

In [5]:
group1

In [6]:
group1.mean()
# since k2 do not contain numerical values
# dropped automatically from the groupby.mean

    dataset1  dataset2
k1
X   0.154083 -0.626099
Y  -0.664401 -0.174928
Z  -0.064961  0.093311

In [18]:
group1.sum()

k1
X    0.308166
Y   -1.328802
Z   -0.064961
Name: dataset1, dtype: float64

In [8]:
# group data in one column by another 
group1 = dframe['dataset1'].groupby(dframe['k1'])
# must call dframe['k1']

In [10]:
group1.mean()

k1
X    0.154083
Y   -0.664401
Z   -0.064961
Name: dataset1, dtype: float64

In [19]:
# group by multiple columns
dframe.groupby(['k1','k2'])
# returns a dframe with hierarchical index

dframe.groupby(['k1','k2']).mean()

In [16]:
# group one column by multiple columns
dataset2_group =dframe.groupby(['k1','k2'])[['dataset2']]
# dframe['dataset2'].groupby(dframe['k1','k2']) is not valid code

In [17]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.058025
   beta  -1.310223
Y  alpha -0.777103
   beta   0.427247
Z  alpha  0.093311

In [25]:
# assign keys to dataset1 and group by them
cities =np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB','JAN'])

In [28]:
dframe.groupby([cities,month]).mean()
dframe['datset1'].groupby([cities, month]).mean()

        dataset1  dataset2
LA FEB  0.592077 -1.310223
   JAN -0.785870 -0.777103
NY FEB -0.542932  0.427247
   JAN -0.174436  0.075668

In [32]:
# iterate over groups 
for name,group in dframe.groupby('k1'):
    # %s get the string %name labels its name
    print "This is the %s group" %name
    print group
    print '\n' # prints a new line

This is the X group
   dataset1  dataset2 k1     k2
0 -0.283911  0.058025  X  alpha
1  0.592077 -1.310223  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2 -0.785870 -0.777103  Y  alpha
3 -0.542932  0.427247  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4 -0.064961  0.093311  Z  alpha

In [4]:
group1 = dframe.groupby(['k1','k2'])

In [5]:
group1

In [8]:
for (k1,k2), group in dframe.groupby(['k1','k2']):
    print "Key1 = %s Key2 =%s " %(k1,k2)
    print group
    print '\n'

Key1 = X Key2 =alpha
   dataset1  dataset2 k1     k2
0  0.309461  0.116702  X  alpha


Key1 = X Key2 =beta
   dataset1  dataset2 k1    k2
1 -0.357755  1.133424  X  beta


Key1 = Y Key2 =alpha
   dataset1  dataset2 k1     k2
2  0.392646  2.208642  Y  alpha


Key1 = Y Key2 =beta
   dataset1  dataset2 k1    k2
3 -0.044744  0.788048  Y  beta


Key1 = Z Key2 =alpha
   dataset1  dataset2 k1     k2
4 -2.107884 -0.690729  Z  alpha

In [9]:
# create a dictionary from the grouped data pieces
group_dict = dict(list(dframe.groupby('k1')))

In [10]:
group_dict['X']

   dataset1  dataset2 k1     k2
0  0.309461  0.116702  X  alpha
1 -0.357755  1.133424  X   beta

In [11]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
# group in the direction axis = 1

In [12]:
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0  0.309461  0.116702
 1 -0.357755  1.133424
 2  0.392646  2.208642
 3 -0.044744  0.788048
 4 -2.107884 -0.690729, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [13]:
# can also group data by data types
dframe.dtypes

dataset1    float64
dataset2    float64
k1           object
k2           object
dtype: object

In [15]:
list(dframe.groupby(dframe.dtypes, axis=1))

[(dtype('float64'),    dataset1  dataset2
  0  0.309461  0.116702
  1 -0.357755  1.133424
  2  0.392646  2.208642
  3 -0.044744  0.788048
  4 -2.107884 -0.690729), (dtype('O'),   k1     k2
  0  X  alpha
  1  X   beta
  2  Y  alpha
  3  Y   beta
  4  Z  alpha)]